In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
actor_ori= pd.read_csv('w3-database-project/data/actor.csv', encoding='latin1')
category_ori= pd.read_csv('w3-database-project/data/category.csv', encoding='latin1') 
film_ori= pd.read_csv('w3-database-project/data/film.csv', encoding='latin1') 
inventory_ori= pd.read_csv('w3-database-project/data/inventory.csv', encoding='latin1') 
language_ori= pd.read_csv('w3-database-project/data/language.csv', encoding='latin1') 
old_HDD_ori= pd.read_csv('w3-database-project/data/old_HDD.csv', encoding='latin1')
rental_ori= pd.read_csv('w3-database-project/data/rental.csv', encoding='latin1')

In [3]:
pd.set_option('display.max_columns', None)

In [4]:
#eliminamos la columna original_languaje_id porque vemos que esa columna tiene el 100% de los valores nulos.
nan_cols=film_ori.isna().sum()
nan_cols[nan_cols>0]

original_language_id    1000
dtype: int64

In [5]:
#eliminamos la columna original_languaje_id porque vemos que esa columna tiene el 100% de los valores nulos.
film_ori.drop(columns=['original_language_id'], inplace=True)

In [6]:
#comprobamos que no tengan filas duplicadas cada uno de los archivos. (NO HAY)
rental_ori.duplicated().any()

False

In [7]:
#las columnas 'last_update' eliminamos la hora para quedarnos solamente con la fecha
actor_ori['last_update']= pd.to_datetime(actor_ori['last_update']).dt.date
inventory_ori['last_update']= pd.to_datetime(inventory_ori['last_update']).dt.date
language_ori['last_update']= pd.to_datetime(language_ori['last_update']).dt.date
rental_ori['last_update']= pd.to_datetime(rental_ori['last_update']).dt.date
category_ori['last_update']= pd.to_datetime(category_ori['last_update']).dt.date
film_ori['last_update']= pd.to_datetime(film_ori['last_update']).dt.date

In [8]:
rental_ori.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15

In [9]:
actor_ori.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [10]:
#creamos 4 columnas nuevas
film_ori=film_ori[['film_id', 'title', 'description', 'release_year', 'language_id',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features','special_features','special_features','special_features',
        'last_update']].copy()

In [11]:
#cambiamos el nombre de esas 4 columnas
film_ori.columns=['film_id', 'title', 'description', 'release_year', 'language_id',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'Behind_the_Scenes','Commentaries','Deleted_Scenes','Trailers',
        'last_update']

In [12]:
#creamos una funcion para que cada columna me diga si tiene o no esas special_features
def deleted_scenes(e):
    if 'Deleted' in e:
        return 'Yes'
    else:
        return 'No'

In [13]:
film_ori.Deleted_Scenes=film_ori.Deleted_Scenes.apply(deleted_scenes)

In [14]:
def behind_the_scenes(e):
    if 'Behind' in e:
        return 'Yes'
    else:
        return 'No'

In [15]:
film_ori.Behind_the_Scenes=film_ori.Behind_the_Scenes.apply(behind_the_scenes)

In [16]:
def commentaries(e):
    if 'Commentaries' in e:
        return 'Yes'
    else:
        return 'No'

In [17]:
film_ori.Commentaries=film_ori.Commentaries.apply(commentaries)

In [18]:
def trailers(e):
    if 'Trailers' in e:
        return 'Yes'
    else:
        return 'No'

In [19]:
film_ori.Trailers=film_ori.Trailers.apply(trailers)

In [20]:
film_ori.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,Behind_the_Scenes,Commentaries,Deleted_Scenes,Trailers,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,Yes,No,Yes,No,2006-02-15
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,No,No,Yes,Yes,2006-02-15
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,No,No,Yes,Yes,2006-02-15
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,Yes,Yes,No,No,2006-02-15
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,No,No,Yes,No,2006-02-15

In [21]:
old_HDD_ori.head(3)

  first_name last_name                 title  release_year  category_id
0   PENELOPE   GUINESS      ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS  ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS           ANGELS LIFE          2006           13

In [22]:
#creamos una nueva columna en la tabla old_HDD donde nos traiga el actor_id de la tabla ACTOR
actor_id=[]
for e in (old_HDD_ori.values):
    for a in actor_ori.values:
        if e[0]==a[1] and e[1]==a[2]:
            actor_id.append(a[0])
old_HDD_ori['actor_id']=actor_id

In [23]:
new_list = []
for d in old_HDD_ori.title:
    for i in range(len(old_HDD_ori.title)):
        if d == film_ori.title[i]:
            new_list.append(film_ori.film_id[i])
old_HDD_ori['film_id']=new_list

In [24]:
old_HDD_ori.head()

,first_name,last_name,title,release_year,category_id,actor_id,film_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,1,1
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,1,23
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,1,25
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,1,106
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,1,140

In [25]:
#concatenamos columnas first y last name 
old_HDD_ori['full_name'] = old_HDD_ori.first_name.str.cat(old_HDD_ori.last_name, sep=' ')

In [26]:
actor_ori['full_name'] = actor_ori.first_name.str.cat(actor_ori.last_name, sep=' ')

In [27]:
old_HDD_ori.drop('first_name', axis=1, inplace=True)

In [28]:
old_HDD_ori.drop('last_name', axis=1, inplace=True)

In [29]:
actor_ori.drop('first_name', axis=1, inplace=True)

In [30]:
actor_ori.drop('last_name', axis=1, inplace=True)

In [31]:
%pip install pymysql
from sqlalchemy import create_engine

Requirement already satisfied: pymysql in /Users/arturo/opt/anaconda3/lib/python3.9/site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [32]:
str_conn='mysql+pymysql://root:Pamplona1995@localhost:3306'

cursor=create_engine(str_conn)


cursor.execute('drop database if exists cinema;')

cursor.execute('create database cinema;')

In [33]:
actor_ori

     actor_id last_update            full_name
0           1  2006-02-15     PENELOPE GUINESS
1           2  2006-02-15        NICK WAHLBERG
2           3  2006-02-15             ED CHASE
3           4  2006-02-15       JENNIFER DAVIS
4           5  2006-02-15  JOHNNY LOLLOBRIGIDA
..        ...         ...                  ...
195       196  2006-02-15          BELA WALKEN
196       197  2006-02-15           REESE WEST
197       198  2006-02-15          MARY KEITEL
198       199  2006-02-15        JULIA FAWCETT
199       200  2006-02-15         THORA TEMPLE

[200 rows x 3 columns]

In [34]:
#exportamos a csv

In [35]:
actor_ori.to_csv('w3-database-project/data/actor_clean.csv', index=False)

In [36]:
category_ori.to_csv('w3-database-project/data/category_ori.csv', index=False)

In [37]:
film_ori.to_csv('w3-database-project/data/film_ori.csv', index=False)

In [38]:
inventory_ori.to_csv('w3-database-project/data/inventory_ori.csv', index=False)

In [39]:
language_ori.to_csv('w3-database-project/data/language_ori.csv', index=False)

In [40]:
old_HDD_ori.to_csv('w3-database-project/data/old_HDD_ori.csv', index=False)

In [41]:
rental_ori.to_csv('w3-database-project/data/rental_ori.csv', index=False)

In [43]:
str_conn='mysql+pymysql://root:Pamplona1995@localhost:3306/cinema'
cursor=create_engine(str_conn)

In [ ]:
#enviamos los datos a MySQL

In [44]:
actor_ori.to_sql(name='actor', con=cursor, if_exists='append', index=False)

200

In [46]:
category_ori.to_sql(name='category', con=cursor, if_exists='append', index=False)

16

In [47]:
language_ori.to_sql(name='language', con=cursor, if_exists='append', index=False)

6

In [48]:
film_ori.to_sql(name='film', con=cursor, if_exists='append', index=False)

1000

In [49]:
inventory_ori.to_sql(name='inventory', con=cursor, if_exists='append', index=False)

1000

In [50]:
rental_ori.to_sql(name='rental', con=cursor, if_exists='append', index=False)

1000

In [51]:
old_HDD_ori.to_sql(name='old_HDD', con=cursor, if_exists='append', index=False)

1000

In [60]:
old_HDD_ori.film_id.duplicated().any()

True

In [65]:
film_ori.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,Behind_the_Scenes,Commentaries,Deleted_Scenes,Trailers,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,Yes,No,Yes,No,2006-02-15
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,No,No,Yes,Yes,2006-02-15
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,No,No,Yes,Yes,2006-02-15
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,Yes,Yes,No,No,2006-02-15
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,No,No,Yes,No,2006-02-15